package model;

public enum DestributionStatus {

	Завершено(3),Ожидается(4),Заморожено(5),Отмена(6);
	int statValue;
	
//==================================================================================================	
	 DestributionStatus(int statValue){
		
		this.statValue = statValue;
	}
	 
//--------------------------------------------------------------------------------------------------
//==================================================================================================

	 public int getValue(){
		 
		 return this.statValue;
	 }

}
